app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(post_params(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Audio Engineering 101"], ["room_number", 114], ["created_at", "2021-03-21 22:12:48.517862"], ["updated_at", "2021-03-21 22:12:48.517862"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(post_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Audio Engineering 104"], ["room_number", 206], ["updated_at", "2021-03-21 22:14:47.437894"], ["id", 1]]